import React from 'react';

const PolicyPage = () => {
  return (
    <>
      <div className="section">
        <h2>Политика конфиденциальности. </h2>
        <p>
          Настоящий документ «Политика конфиденциальности» (далее по тексту – «Политика») представляет собой правила
          использования разработчиком Haddan extension (далее «Разработчик») данных интернет-пользователей (далее «вы»
          и/или «Пользователь»), собираемых с использованием{' '}
          <a
            href="https://chrome.google.com/webstore/detail/nnjejijoopnfgolmbmajjidnjmknilhj"
            target="_blank"
            rel="noopener noreferrer"
          >
            приложения
          </a>{' '}
          (далее – «Приложение»).
        </p>
        <h3>1. Обрабатываемые данные</h3>
        <p>
          1.1. Разработчик не осуществляет сбор ваших персональных данных с использованием Приложения.
          <br />
          1.2. Все данные, собираемые Приложением, предоставляются и принимаются в обезличенной форме (далее –
          «Обезличенные данные»).
          <br />
          1.3. Обезличенные данные включают следующие сведения, которые не позволяют вас идентифицировать:
          <br />
          1.3.1. Графический материал сайта{' '}
          <a href="http://haddan.ru" target="_blank" rel="noopener noreferrer">
            http://haddan.ru
          </a>{' '}
          , к которому Пользователь предоставляет доступ.
          <br />
          1.4. Разработчик вправе устанавливать требования к составу Обезличенных данных Пользователя, которые
          собираются использованием Приложения.
          <br />
          1.5. Если определенная информация не помечена как обязательная, ее предоставление или раскрытие осуществляется
          Пользователем на свое усмотрение и по собственной инициативе.
          <br />
          1.6. Разработчик не несет ответственность за порядок использования Обезличенных данных Пользователя третьими
          лицами.
        </p>

        <h3>2. Цели обработки данных</h3>
        <p>
          2.1. Разработчик использует данные в следующих целях:
          <br />
          2.1.1. Распознавание текста на изображениях и передача его Пользователю;
        </p>

        <h3>3. Требования к защите данных</h3>
        <p>3.1. Разработчик не осуществляет хранение пользовательских данных.</p>

        <h3>4. Передача данных</h3>
        <p>
          4.1. Разработчик вправе передать данные третьим лицам в следующих случаях:
          <br />
          4.1.1 Передача необходима в рамках использования Пользователем функциональных возможностей Приложения;
          <br />
          4.1.2 Передача требуется в соответствии с целями обработки данных;
        </p>

        <h3>5. Изменение Политики конфиденциальности</h3>
        <p>
          5.1. Настоящая Политика может быть изменена или прекращена Разработчиком в одностороннем порядке без
          предварительного уведомления Пользователя. Новая редакция Политики вступает в силу с момента ее размещения на
          Сайте, если иное не предусмотрено новой редакцией Политики.
        </p>
        <p>Действующая редакция Политики от 01.01.2022 г.</p>
      </div>
    </>
  );
};

export default PolicyPage;
